# SlabShapeEditor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RoofBase..::..SlabShapeEditor Property
RoofBase Class See Also
---
Get the SlabShapeEditor used for slab shape editing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")]
public SlabShapeEditor SlabShapeEditor { get; }
```

Visual Basic
---
```text
<ObsoleteAttribute("This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")> _
Public ReadOnly Property SlabShapeEditor As SlabShapeEditor
	Get
```

Visual C++
---
```text
[ObsoleteAttribute(L"This method is deprecated in Revit 2024 and may be removed in a future version of Revit. Use GetSlabShapeEditor() instead.")]
public:
property SlabShapeEditor^ SlabShapeEditor {
	SlabShapeEditor^ get ();
}
```

# Remarks
Roofs cannot be attached to another roof, and the roof cannot be a curtain roof. If either of these conditions is not met, the ShapeEditor will be nullNothingnullptra null reference (Nothing in Visual Basic).
# See Also
RoofBase Class
Autodesk.Revit.DB Namespace